adr-tools
bat
docker-completion
eza
fd
fzf
gcc
gh
gnupg
go-swagger/go-swagger/go-swagger
go@1.22
golang-migrate
golangci-lint
graphviz
haskell-stack
helix
httpie
jq
kcat
lazygit
llvm
lsd
luarocks
mockery
neovim
node
nushell
ollama
openjdk@21
pgcli
pinentry-mac
podman-compose
postgresql@14
python@3.11
qemu
redis
ripgrep
rust-analyzer
sonarqube
starship
stow
task
temporal
tldr
tmux
wget
yq
zellij
zoxide
zsh
