gcc
gh
gnupg
go-swagger/go-swagger/go-swagger
go
golang-migrate
golangci-lint
kcat
lazygit
lsd
luarocks
neovim
ollama
pgcli
qemu
task
yq
zls
tldr
watchexec
tmux
stow
wget
zoxide
zsh
zellij
bat
docker-completion
eza
fd
fzf
jq
podman-compose
ripgrep
starship
pinentry-mac
atuin
markdownlint-cli
markdown-toc
prettier
sqlfluff
ghostty
firefox
fish
lazyjj
